Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.Luminosity
The luminosity value.
The luminosity value in cd as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The luminosity value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialLuminousIntensity)
Creates a copy of the given initial luminous intensity object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.#ctor(System.Double)
Creates an initial luminous intensity object with the given document and luminosity values.
luminosity:
The luminosity value in cd as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The luminosity value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
This class encapsulates initial luminous intensity calculation.
Since:
2013